In [1]:
#pip install pandas

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('/Users/macosx/Downloads/ecommerce.csv')

/Users/macosx/opt/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3146: DtypeWarning: Columns (8,9) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [4]:
df.head()

,Order ID,Order Date,Ship Date,Aging,Ship Mode,Product Category,Product,Sales,Quantity,Discount,...,Shipping Cost,Order Priority,Customer ID,Customer Name,Segment,City,State,Country,Region,Months
0,AU-2015-1,11/9/15,11/17/15,8.0,First Class,Auto & Accessories,Car Media Players,$140.00,2,0.05,...,$4.60,Medium,LS-001,Lane Daniels,Consumer,Brisbane,Queensland,Australia,Oceania,Nov
1,AU-2015-2,6/30/15,7/2/15,2.0,First Class,Auto & Accessories,Car Speakers,$211.00,3,0.03,...,$11.20,Medium,IZ-002,Alvarado Kriz,Home Office,Berlin,Berlin,Germany,Central,Jun
2,AU-2015-3,12/5/15,12/13/15,8.0,First Class,Auto & Accessories,Car Body Covers,$117.00,5,0.01,...,$3.10,Critical,EN-003,Moon Weien,Consumer,Porirua,Wellington,New Zealand,Oceania,Dec
3,AU-2015-4,5/9/15,5/16/15,7.0,First Class,Auto & Accessories,Car & Bike Care,$118.00,2,0.05,...,$2.60,High,AN-004,Sanchez Bergman,Corporate,Kabul,Kabul,Afghanistan,Central Asia,May
4,AU-2015-5,7/9/15,7/18/15,9.0,First Class,Auto & Accessories,Tyre,$250.00,1,0.04,...,$16.00,Critical,ON-005,Rowe Jackson,Corporate,Townsville,Queensland,Australia,Oceania,Jul

In [5]:
df.isna().sum()

Order ID            0
Order Date          1
Ship Date           0
Aging               1
Ship Mode           0
Product Category    0
Product             0
Sales               0
Quantity            1
Discount            0
Profit              0
Shipping Cost       0
Order Priority      2
Customer ID         1
Customer Name       0
Segment             1
City                0
State               0
Country             0
Region              1
Months              0
dtype: int64

In [6]:
df = df.dropna()

In [7]:
df.to_csv('/Users/macosx/Downloads/ecommerce_vf.csv')

In [8]:
df.isna().sum()

Order ID            0
Order Date          0
Ship Date           0
Aging               0
Ship Mode           0
Product Category    0
Product             0
Sales               0
Quantity            0
Discount            0
Profit              0
Shipping Cost       0
Order Priority      0
Customer ID         0
Customer Name       0
Segment             0
City                0
State               0
Country             0
Region              0
Months              0
dtype: int64

In [9]:
df.shape

(51282, 21)

In [10]:
df.describe()

              Aging
count  51282.000000
mean       5.255265
std        2.960027
min        1.000000
25%        3.000000
50%        5.000000
75%        8.000000
max       10.500000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 51282 entries, 0 to 51289
Data columns (total 21 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          51282 non-null  object
 1   Order Date        51282 non-null  object
 2   Ship Date         51282 non-null  object
 3   Aging             51282 non-null  float64
 4   Ship Mode         51282 non-null  object
 5   Product Category  51282 non-null  object
 6   Product           51282 non-null  object
 7   Sales             51282 non-null  object
 8   Quantity          51282 non-null  object
 9   Discount          51282 non-null  object
 10  Profit            51282 non-null  object
 11  Shipping Cost     51282 non-null  object
 12  Order Priority    51282 non-null  object
 13  Customer ID       51282 non-null  object
 14  Customer Name     51282 non-null  object
 15  Segment           51282 non-null  object
 16  City              51282 non-null  object
 17  State             51282 non-null  object
 18  Country           51282 non-null  object
 19  Region            51282 non-null  object
 20  Months            51282 non-null  object
dtypes: float64(1), object(20)
memory usage: 8.6+ MB

In [12]:
df.Sales

0        $140.00
1        $211.00
2        $117.00
3        $118.00
4        $250.00
           ...
51285     $85.00
51286     $85.00
51287     $85.00
51288     $85.00
51289     $85.00
Name: Sales, Length: 51282, dtype: object

In [13]:
df['Ship Date']

0        11/17/15
1          7/2/15
2        12/13/15
3         5/16/15
4         7/18/15
           ...
51285     1/27/15
51286     6/24/15
51287      1/7/15
51288    12/14/15
51289     12/6/15
Name: Ship Date, Length: 51282, dtype: object

In [14]:
df['Ship Date'] = pd.to_datetime(df['Ship Date'])

In [15]:
df['mois'] =df['Ship Date'].apply(lambda x: x.month)
df['jours'] =df['Ship Date'].apply(lambda x: x.day)

In [16]:
df.head(3)

,Order ID,Order Date,Ship Date,Aging,Ship Mode,Product Category,Product,Sales,Quantity,Discount,...,Customer ID,Customer Name,Segment,City,State,Country,Region,Months,mois,jours
0,AU-2015-1,11/9/15,2015-11-17,8.0,First Class,Auto & Accessories,Car Media Players,$140.00,2,0.05,...,LS-001,Lane Daniels,Consumer,Brisbane,Queensland,Australia,Oceania,Nov,11,17
1,AU-2015-2,6/30/15,2015-07-02,2.0,First Class,Auto & Accessories,Car Speakers,$211.00,3,0.03,...,IZ-002,Alvarado Kriz,Home Office,Berlin,Berlin,Germany,Central,Jun,7,2
2,AU-2015-3,12/5/15,2015-12-13,8.0,First Class,Auto & Accessories,Car Body Covers,$117.00,5,0.01,...,EN-003,Moon Weien,Consumer,Porirua,Wellington,New Zealand,Oceania,Dec,12,13

In [17]:
df.Profit

0         $46.00
1        $112.00
2         $31.20
3         $26.20
4        $160.00
           ...
51285     $17.00
51286      $2.50
51287      $0.80
51288     $28.30
51289     $28.30
Name: Profit, Length: 51282, dtype: object

In [18]:
df['Profit'] =df['Profit'].apply(lambda x: x[2:-1])
df['Sales'] =df['Sales'].apply(lambda x: x[2:-1])

In [19]:
df.head(3)

,Order ID,Order Date,Ship Date,Aging,Ship Mode,Product Category,Product,Sales,Quantity,Discount,...,Customer ID,Customer Name,Segment,City,State,Country,Region,Months,mois,jours
0,AU-2015-1,11/9/15,2015-11-17,8.0,First Class,Auto & Accessories,Car Media Players,40.00,2,0.05,...,LS-001,Lane Daniels,Consumer,Brisbane,Queensland,Australia,Oceania,Nov,11,17
1,AU-2015-2,6/30/15,2015-07-02,2.0,First Class,Auto & Accessories,Car Speakers,11.00,3,0.03,...,IZ-002,Alvarado Kriz,Home Office,Berlin,Berlin,Germany,Central,Jun,7,2
2,AU-2015-3,12/5/15,2015-12-13,8.0,First Class,Auto & Accessories,Car Body Covers,17.00,5,0.01,...,EN-003,Moon Weien,Consumer,Porirua,Wellington,New Zealand,Oceania,Dec,12,13

In [20]:
df['Quantity'].value_counts()

4      6629
3      6564
5      6545
1      6539
2      6482
1      3756
3      3743
2      3727
5      3649
4      3647
abc       1
Name: Quantity, dtype: int64

In [21]:
df = df[df.Quantity != 'abc']

In [22]:
df['Quantity'].value_counts()

4    6629
3    6564
5    6545
1    6539
2    6482
1    3756
3    3743
2    3727
5    3649
4    3647
Name: Quantity, dtype: int64

In [23]:
df['Quantity'] =df['Quantity'].astype(int)

In [24]:
df = df[df.Sales != 'x']

In [25]:
df['Sales'] = df['Sales'].astype(float)

In [26]:
df.dtypes

Order ID                    object
Order Date                  object
Ship Date           datetime64[ns]
Aging                      float64
Ship Mode                   object
Product Category            object
Product                     object
Sales                      float64
Quantity                     int64
Discount                    object
Profit                      object
Shipping Cost               object
Order Priority              object
Customer ID                 object
Customer Name               object
Segment                     object
City                        object
State                       object
Country                     object
Region                      object
Months                      object
mois                         int64
jours                        int64
dtype: object

In [27]:
df['Discount'].value_counts()
df = df[df.Discount != 'xxx']
df['Discount'] = df['Discount'].astype(float)

In [28]:
df.head(3)

,Order ID,Order Date,Ship Date,Aging,Ship Mode,Product Category,Product,Sales,Quantity,Discount,...,Customer ID,Customer Name,Segment,City,State,Country,Region,Months,mois,jours
0,AU-2015-1,11/9/15,2015-11-17,8.0,First Class,Auto & Accessories,Car Media Players,40.0,2,0.05,...,LS-001,Lane Daniels,Consumer,Brisbane,Queensland,Australia,Oceania,Nov,11,17
1,AU-2015-2,6/30/15,2015-07-02,2.0,First Class,Auto & Accessories,Car Speakers,11.0,3,0.03,...,IZ-002,Alvarado Kriz,Home Office,Berlin,Berlin,Germany,Central,Jun,7,2
2,AU-2015-3,12/5/15,2015-12-13,8.0,First Class,Auto & Accessories,Car Body Covers,17.0,5,0.01,...,EN-003,Moon Weien,Consumer,Porirua,Wellington,New Zealand,Oceania,Dec,12,13

In [29]:
df.columns

Index(['Order ID', 'Order Date', 'Ship Date', 'Aging', 'Ship Mode',
       'Product Category', 'Product', 'Sales', 'Quantity', 'Discount',
       'Profit', 'Shipping Cost', 'Order Priority', 'Customer ID',
       'Customer Name', 'Segment', 'City', 'State', 'Country', 'Region',
       'Months', 'mois', 'jours'],
      dtype='object')

In [30]:
df['Order ID'].value_counts()
df['Discount'] = df['Discount'].astype(float)

In [31]:
df.to_csv('/Users/macosx/Downloads/ecommerce_vf.csv')

In [32]:
df1=pd.read_csv('/Users/macosx/Downloads/ecommerce_vf.csv')

In [33]:
df1.head()

,Unnamed: 0,Order ID,Order Date,Ship Date,Aging,Ship Mode,Product Category,Product,Sales,Quantity,...,Customer ID,Customer Name,Segment,City,State,Country,Region,Months,mois,jours
0,0,AU-2015-1,11/9/15,2015-11-17,8.0,First Class,Auto & Accessories,Car Media Players,40.0,2,...,LS-001,Lane Daniels,Consumer,Brisbane,Queensland,Australia,Oceania,Nov,11,17
1,1,AU-2015-2,6/30/15,2015-07-02,2.0,First Class,Auto & Accessories,Car Speakers,11.0,3,...,IZ-002,Alvarado Kriz,Home Office,Berlin,Berlin,Germany,Central,Jun,7,2
2,2,AU-2015-3,12/5/15,2015-12-13,8.0,First Class,Auto & Accessories,Car Body Covers,17.0,5,...,EN-003,Moon Weien,Consumer,Porirua,Wellington,New Zealand,Oceania,Dec,12,13
3,3,AU-2015-4,5/9/15,2015-05-16,7.0,First Class,Auto & Accessories,Car & Bike Care,18.0,2,...,AN-004,Sanchez Bergman,Corporate,Kabul,Kabul,Afghanistan,Central Asia,May,5,16
4,4,AU-2015-5,7/9/15,2015-07-18,9.0,First Class,Auto & Accessories,Tyre,50.0,1,...,ON-005,Rowe Jackson,Corporate,Townsville,Queensland,Australia,Oceania,Jul,7,18

In [34]:
df1.dtypes

Unnamed: 0            int64
Order ID             object
Order Date           object
Ship Date            object
Aging               float64
Ship Mode            object
Product Category     object
Product              object
Sales               float64
Quantity              int64
Discount            float64
Profit              float64
Shipping Cost        object
Order Priority       object
Customer ID          object
Customer Name        object
Segment              object
City                 object
State                object
Country              object
Region               object
Months               object
mois                  int64
jours                 int64
dtype: object

In [35]:
df1['Shipping Cost']

0         $4.60
1        $11.20
2         $3.10
3         $2.60
4        $16.00
          ...
51274     $1.70
51275     $0.20
51276     $0.10
51277     $2.80
51278     $2.80
Name: Shipping Cost, Length: 51279, dtype: object

In [36]:
df2= df1[:5000]

In [38]:
df2.dtypes

Unnamed: 0            int64
Order ID             object
Order Date           object
Ship Date            object
Aging               float64
Ship Mode            object
Product Category     object
Product              object
Sales               float64
Quantity              int64
Discount            float64
Profit              float64
Shipping Cost        object
Order Priority       object
Customer ID          object
Customer Name        object
Segment              object
City                 object
State                object
Country              object
Region               object
Months               object
mois                  int64
jours                 int64
dtype: object

In [44]:
str(df2['Ship Date'])

'0       0       2015-11-17\\n1       2015-07-02\\n2     ...\n1       0       2015-11-17\\n1       2015-07-02\\n2     ...\n2       0       2015-11-17\\n1       2015-07-02\\n2     ...\n3       0       2015-11-17\\n1       2015-07-02\\n2     ...\n4       0       2015-11-17\\n1       2015-07-02\\n2     ...\n                              ...                        \n4995    0       2015-11-17\\n1       2015-07-02\\n2     ...\n4996    0       2015-11-17\\n1       2015-07-02\\n2     ...\n4997    0       2015-11-17\\n1       2015-07-02\\n2     ...\n4998    0       2015-11-17\\n1       2015-07-02\\n2     ...\n4999    0       2015-11-17\\n1       2015-07-02\\n2     ...\nName: Ship Date, Length: 5000, dtype: object'

In [45]:
df2.dtypes

Unnamed: 0            int64
Order ID             object
Order Date           object
Ship Date            object
Aging               float64
Ship Mode            object
Product Category     object
Product              object
Sales               float64
Quantity              int64
Discount            float64
Profit              float64
Shipping Cost        object
Order Priority       object
Customer ID          object
Customer Name        object
Segment              object
City                 object
State                object
Country              object
Region               object
Months               object
mois                  int64
jours                 int64
dtype: object

In [39]:
df2.to_csv('/Users/macosx/Downloads/ecommerce_vf1.csv')

In [40]:
df3=df2[['Product','Product Category']]
df4=df2[['Sales','Quantity']]
df5=df2[['Discount','Quantity','Profit']]
df6=df2[['Ship Date','mois','jours']]
df7=df2[['Segment']]
df8=df2[['Region','State','Country','City']]

In [41]:
df8

           Region             State        Country         City
0         Oceania        Queensland      Australia     Brisbane
1         Central            Berlin        Germany       Berlin
2         Oceania        Wellington    New Zealand      Porirua
3    Central Asia             Kabul    Afghanistan        Kabul
4         Oceania        Queensland      Australia   Townsville
..            ...               ...            ...          ...
195        Canada  British Columbia         Canada    Vancouver
196         North         Stockholm         Sweden      Haninge
197         South           Georgia  United States      Atlanta
198       Central         Minnesota  United States  Minneapolis
199         South          Campania          Italy     Pozzuoli

[200 rows x 4 columns]

In [42]:
df3.to_csv('/Users/macosx/Downloads/product.csv' , index = None)
df4.to_csv('/Users/macosx/Downloads/vente.csv')
df5.to_csv('/Users/macosx/Downloads/promo.csv')
df6.to_csv('/Users/macosx/Downloads/date.csv')
df7.to_csv('/Users/macosx/Downloads/customer.csv')
df8.to_csv('/Users/macosx/Downloads/region.csv')

In [43]:
df5.head()

   Discount  Quantity  Profit
0      0.05         2     6.0
1      0.03         3    12.0
2      0.01         5     1.2
3      0.05         2     6.2
4      0.04         1    60.0

In [44]:
dff= pd.read_csv('/Users/macosx/Downloads/product.csv')
dff.head()

             Product    Product Category
0  Car Media Players  Auto & Accessories
1       Car Speakers  Auto & Accessories
2    Car Body Covers  Auto & Accessories
3    Car & Bike Care  Auto & Accessories
4               Tyre  Auto & Accessories

In [54]:
df4.Sales

0      40.0
1      11.0
2      17.0
3      18.0
4      50.0
       ...
195    17.0
196    18.0
197    50.0
198     2.0
199     4.0
Name: Sales, Length: 200, dtype: float64

In [62]:
float("123456.908".replace(',',''))

123456.908

In [63]:
df7

         Segment
0       Consumer
1    Home Office
2       Consumer
3      Corporate
4      Corporate
..           ...
195     Consumer
196     Consumer
197     Consumer
198     Consumer
199    Corporate

[200 rows x 1 columns]